app/controllers/concerts_controller.rb

SELECT "concerts".* FROM "concerts"
---
  def index
    @concerts = Concert.all

SELECT "groups".* FROM "groups"
---
  def new
    @concert = Concert.new
    @groups = Group.all

SELECT "groups".* FROM "groups"
---
  def edit
    @groups = Group.all

INSERT INTO "concerts" ("location", "concert_date", "audience", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["location", "chile"], ["concert_date", "2021-10-18"], ["audience", 4], ["group_id", 5], ["created_at", "2021-10-18 13:53:20.471202"], ["updated_at", "2021-10-18 13:53:20.471202"]]
---
  def create
    @concert = Concert.new(concert_params)

    respond_to do |format|
      if @concert.save

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_concert
      @concert = Concert.find(params[:id])