app/models/group.rb

    def total_concerts
        self.concerts.count
---
SELECT COUNT(*) FROM "concerts" WHERE "concerts"."group_id" = ?  [["group_id", 1]]

    def debut
        concerts = self.concerts
        if concerts.present?
            concerts.order(concert_date: :desc).first.concert_date
---
SELECT "concerts".* FROM "concerts" WHERE "concerts"."group_id" = ?  [["group_id", 1]]
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."group_id" = ? ORDER BY "concerts"."concert_date" DESC LIMIT ?  [["group_id", 5], ["LIMIT", 1]]